app/views/devise/registrations/new.html.erb

SELECT "countries".* FROM "countries"
---
      <label for="locale" class="label">Country</label>
      <%= f.collection_select :country_id, Country.all, :id, :name, {prompt: 'Select One'}, class: "selectpicker form-control input-lg", "data-live-search": "true", "data-size": 5 %>