app/controllers/dashboards_controller.rb

  def index
    if user_signed_in?
      @dashboard = current_user.dashboard
      @galleries = current_brand.galleries.where(is_delete: false)
      if @dashboard.add_gallery == false && @galleries.count > 0
        @dashboard.update(add_gallery: true)
      end
      @photos = Photo.where("imageable_id IN(?) AND imageable_type = ?", @galleries.pluck(:id), "Gallery")
      if @dashboard.upload_photos == false && @photos.count > 0
        @dashboard.update(upload_photos: true)
      end
      @watermark = current_brand.watermarks.where(is_first: false)
      if @dashboard.customize_watermark == false && @watermark.present?
        @dashboard.update(customize_watermark: true)
      end
      @color_logo = current_brand.color_logos.first
      if @color_logo.updated_at > @color_logo.created_at
        @color_logo_present = true
        if @dashboard.setup_colo_logo == false && @color_logo_present == true
          @dashboard.update(setup_colo_logo: true)
        end
      end
      @notifications = current_brand.notifications.where(is_dismiss: false).limit(4)
---
SELECT "galleries"."id" FROM "galleries" WHERE "galleries"."brand_id" = $1 AND "galleries"."is_delete" = $2  [["brand_id", 11], ["is_delete", "f"]]
SELECT  "dashboards".* FROM "dashboards" WHERE "dashboards"."user_id" = $1 LIMIT 1  [["user_id", 11]]
SELECT COUNT(*) FROM "galleries" WHERE "galleries"."brand_id" = $1 AND "galleries"."is_delete" = $2  [["brand_id", 11], ["is_delete", "f"]]
SELECT COUNT(*) FROM "photos" WHERE (imageable_id IN(NULL) AND imageable_type = 'Gallery')
SELECT "watermarks".* FROM "watermarks" WHERE "watermarks"."brand_id" = $1 AND "watermarks"."is_first" = $2  [["brand_id", 11], ["is_first", "f"]]
SELECT  "color_logos".* FROM "color_logos" WHERE "color_logos"."brand_id" = $1  ORDER BY "color_logos"."id" ASC LIMIT 1  [["brand_id", 11]]
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."brand_id" = $1 AND "notifications"."is_dismiss" = $2  ORDER BY "notifications"."id" DESC LIMIT 4  [["brand_id", 11], ["is_dismiss", "f"]]