app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
UPDATE "users" SET "firstname" = $1, "lastname" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["firstname", "Ajay"], ["lastname", "Bhayani"], ["updated_at", "2017-08-08 11:26:53.103989"], ["id", 11]]
---
  def update_profile
    @user = User.find(current_user.id)
    if @user.update_without_password(user_params)