app/views/layouts/_header.html.erb

      <ul class="nav navbar-nav navbar-right">
        <% if current_user.brands.count > 1 %>
---
SELECT COUNT(*) FROM "brands" WHERE "brands"."user_id" = $1  [["user_id", 11]]